Repository: yoko-at-home/reactjs-docs-TM
Catalog: docs/fragments_EN-US_ja.tmx
Source language: en_us
Languages: ja

source: --- id: fragments title: Fragments permalink: docs/fragments.html ---
ja: --- id: fragments title: フラグメント permalink: docs/fragments.html ---

source: A common pattern in React is for a component to return multiple elements.
ja: React でよくあるパターンの 1 つに、コンポーネントが複数の要素を返すというものがあります。

source: Fragments let you group a list of children without adding extra nodes to the DOM.
ja: フラグメント (fragment) を使うことで、DOM に余分なノードを追加することなく子要素をまとめることができるようになります。

source: There is also a new [short syntax](#short-syntax) for declaring them.
ja: このようなものを宣言するための[短い記法](#short-syntax)もあります。

source: ## Motivation {#motivation}
ja: ## 動機 {#motivation}

source: A common pattern is for a component to return a list of children.
ja: コンポーネントが子要素のリストを返すというのはよくあるパターンです。

source: Take this example React snippet:
ja: この React スニペットを例にしましょう：

source: `<Columns />` would need to return multiple `<td>` elements in order for the rendered HTML to be valid.
ja: レンダーされる HTML が正しいものであるためには、`<Columns />` は複数の `<td>` 要素を返す必要があります。

source: If a parent div was used inside the `render()` of `<Columns />`, then the resulting HTML will be invalid.
ja: `<Columns />` 中の `render()` 内で親として div 要素を使ってしまうと、結果として出力される HTML は不正なものとなってしまいます。

source: results in a `<Table />` output of:
ja: 上記では、以下のような `<Table />` の出力となってしまいます：

source: Fragments solve this problem.
ja: フラグメントはこのような問題を解決します。

source: ## Usage {#usage}
ja: ## 使い方 {#usage}

source: which results in a correct `<Table />` output of:
ja: 上記は、以下のような正しい `<Table />` の出力となります：

source: ### Short Syntax {#short-syntax}
ja: ### 短い記法 {#short-syntax}

source: There is a new, shorter syntax you can use for declaring fragments.
ja: フラグメントを宣言するための新しい短縮記法があります。

source: It looks like empty tags:
ja: それは空のタグのようにも見えます：

source: You can use `<></>` the same way you'd use any other element except that it doesn't support keys or attributes.
ja: この `<></>` は他の要素と同じように使うことが可能ですが、key や属性のサポートはありません。

source: ### Keyed Fragments {#keyed-fragments}
ja: ### key 付きフラグメント {#keyed-fragments}

source: Fragments declared with the explicit `<React.Fragment>` syntax may have keys.
ja: 明示的に `<React.Fragment>` と宣言したフラグメントでは key を持つことができます。

source: A use case for this is mapping a collection to an array of fragments -- for example, to create a description list:
ja: これはコレクションをフラグメントの配列に変換するときに有用です。たとえば定義リストを作成する時に利用します：

source: `key` is the only attribute that can be passed to `Fragment`.
ja: `key` はフラグメントに渡すことができる唯一の属性です。

source: In the future, we may add support for additional attributes, such as event handlers.
ja: 将来的には、イベントハンドラのような他の属性を渡すこともサポートするかもしれません。

source: ### Live Demo {#live-demo}
ja: ### ライブデモ {#live-demo}

source: You can try out the new JSX fragment syntax with this [CodePen](https://codepen.io/reactjs/pen/VrEbjE?editors=1000).
ja: この [CodePen](https://codepen.io/reactjs/pen/VrEbjE?editors=1000) で新しい JSX フラグメントの記法を試すことができます。
